УТ.КонтурЗакупки/src/Catalogs/КонтурЗакупки_СтатьиЗатрат/КонтурЗакупки_СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЗакупки_СтатьиЗатрат</name>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.КонтурЗакупки_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРаспределенияЗатрат</name>
    <type>
      <types>EnumRef.КонтурЗакупки_ПоказателиРаспределенияЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВЦене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.КонтурЗакупки/src/Catalogs/КонтурЗакупки_СтатьиЗатрат/Forms/ФормаЭлемента/Module.bsl
// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Объект.СуммаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(Объект.Сумма,
		Объект.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	Объект.Сумма = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(Объект.СуммаБезНДС,
		Объект.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура СуммаБезНДСПриИзменении(Элемент)
	Объект.Сумма = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(Объект.СуммаБезНДС,
		Объект.СтавкаНДС);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
